Revit 2027 API
StairsLanding.GetAllSupports Method
 Returns all the supports hosting the stairs landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetAllSupports()
Public Function GetAllSupports As IList(Of ElementId)
public:
IList<ElementId^>^ GetAllSupports()
member GetAllSupports : unit -> IList<ElementId>
Return Value
IList<ElementId>
 All the supports hosting the stairs landings.
Remarks
 The supports consist of left, right and middle supports of the stairs landing.
See Also
Reference
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace